Repository: Gabrieldrc/me
Catalog: src/locale/messages.*.xlf
Languages: es

# presentationGreeting
source: Hello there, my name is
es: Hola a todos, mi nombre es

# mainAvatarImage
source: avatar image
es: imagen de avatar

# myProfession1
source: I'm a
es: Soy un

# myProfession2
source: Software Developer
es: Desarrollador de Software

# myBeliefsTitle
source: My Beliefs
es: Mis creencias

# beliefsTextContent
source: I believe that experiences are the things that we can share the most as human beings. The experiences of feeling, doing, thinking, knowing and discovering new things about ourselves and the world that surrounds us and what it can become. Everything we think and imagine we have already created, we just need to implement it in our world.
es: Yo creo que las experiencias son las cosas que más podemos compartir como seres humanos. Las experiencias de sentir, hacer, pensar, conocer y descubrir cosas nuevas de nosotros y del mundo que nos rodea y de lo que puede llegar a ser. Todo lo que pensamos e imaginamos ya lo hemos creado solo falta implementarlo en nuestro mundo.

# whatIDoTitle
source: What I do
es: Lo que hago

# whatIDoTextContent
source: As a software developer, I believe that software is one of many mechanisms to make these experiences a reality. With software we can create dreams, solve problems and teach, and neither is less important than the other. It is the path that I found and chose to create those experiences.
es: Como desarrollador de software creo que el software es uno de muchos mecanismo para realizar esas experiencias realidad. Con software podemos crear sueños, solucionar problemas e impartir enseñanza, y ninguna es menos importante que la otra. Es el camino que encontre y elegí para crear esas experiencias.

# howIDoItTitle
source: How I do it
es: Como lo hago

# howIDoTextContent
source: First of all, I must have a clear idea of what I am going to build. With that clear, I look for references if it has already been built before or dealt with certain related topics to find the best solution. Next, I plan what architecture and design it may have.To choose the tools that I will use, I look to see if one of them is easier or is made to deal more with the problem I am trying to face, be it the language, the libraries or the framework. Once these decisions have been made, I am trying to find design patterns that facilitate the maintenance and neatness of the code and the application itself so that it evolves appropriately.
es: Primeramente, debo que tener una idea clara de lo que voy a construir. Con eso claro, busco referencias si es que ya se ha construido antes o tratado ciertos temas relacionados para encontrar la mejor solucion. Luego, planeo la arquitectura y diseño que pueda tener. Para elegir las herramientas que utilizare, busco si alguna tiene mayor facilidad o esta hecha para tratar más el problema que trato de enfrentar, sea el lenguaje, las librerias o framework. Una vez tomado esas desiciones, voy tratando de encontrar patrones de diseño que me faciliten el mantenimiento y proligidad del codigo y la aplicacion misma para que evoluciones de manera adecuada

# builtsAndPracticesTitle
source: Builts and practices
es: Algunas practicas
